var store = [{
        "title": "CoderDojo奈良メンターミーティング開催！",
        "excerpt":"今日は、CoderDojo奈良のスタートに向けて、メンターとしての参加を名乗り出てくださった方々とともに「CoderDojoってどんなことをするのか？」ということを中心にお話してきました。   そして第一回目の日程を決定。これから運動会シーズンに入ることもあって、10月26日と少し先ですがここに向けて準備を進めて行きます。   集まってくださったみなさんは、既に交流のある方がほとんどでしたが、これをきっかけに交流した新しい方々もいらっしゃいました。この「縁」をきっかけ に、また新しい動きが出来ればいいなと思っています。主旨に賛同していただける方なら、いつでも、誰でもWelcomeなので是非連絡ください。   色んな思いはありますが、「悪いものを排除することではなく、良いもので埋めて行くことに力を注ぎたい」そんなことを形にしていきたいです。  ","categories": ["blog"],
        "tags": [],
        "url": "/blog/mentor-meeting/",
        "teaser": "/assets/images/500x300.png"
      },{
        "title": "初めてのCoderDojo奈良、10月26日に開催します！",
        "excerpt":"奈良で初めてのDojoを、2014年10月26日（日）JR奈良駅近くの”Women’s Future Center”にて開催します！   “CoderDojo”とは、アイルランド発祥で世界的に拡がっている、子どもたちにプログラミングやWeb制作などのクリエイティブ活動を体験する場を提供する、ボランタリ(有志による無償)の活動です。近畿地区では、西宮、梅田、難波、熊野などの地域でも開催されています。   教える人（メンター）とは、プログラミングやWeb制作を職業としている方ばかりで、全員無償で活動に参加してくださっています。教わる子どもたち（Dojoでは忍者と呼びます）の参加はもちろん無料。小学生以上高校生以下を対象に、プログラミングやWeb制作を体験する場です。メンター（先生）と一緒にそれぞれのレベルに合わせた活動をしていきますので、お気軽に参加してください。 (^_^)/   大人の方だけの見学も大歓迎です。こういった活動に関心のある方、是非いらしてください！   【持ち物（必須）】   ノートパソコン(Mac or Windowsどちらでも可)   実際にパソコンを使った作業を行います。パソコンの貸し出しはできませんので、ノートパソコンは必ず持参をお願いしますね。   ※会場ではWi-Fiによるインターネット接続が利用可能です。   【利用するサービス／ツール】   Scracth(プログラミング言語)   Mozilla Thimble(Web制作ツール)   参加の申し込み、お問い合わせは、下のリンクからどうぞ。   CoderDojo奈良2014年10月26日  ","categories": ["blog"],
        "tags": [],
        "url": "/blog/2014-10-26-coderdojo-nara/",
        "teaser": "/assets/images/500x300.png"
      },{
        "title": "第1回CoderDojo奈良　開催レポート！",
        "excerpt":"去る2014年10月26日、快晴の日曜日に、記念すべき第1回目のCoderDojo奈良が無事開催されましたよ！   どうも、こんにちは。メンターで参加しております、堀居です。   記念すべき第1回目は・・・   忍者さん5名、メンター10名の総勢15名の参加となりました。   しかも、メンターの中には、奈良が誇る技術集団の卵（！）である国立奈良高専の生徒さん2名の参加もあり、小学1年生から大人までの幅広い年齢層が、パソコンと向き合い和気あいあいとScrachやサイト作成にいそしむ、大変楽しいCoderDojoとなりました！      ほぼ満席でした！   Scrachを初めて触る忍者さんのために、使用方法をスライドを使って説明し、その後は、忍者さんに一人ずつメンターが付き添い、それぞれゲーム作りやサイト作成に取り組みました。      笑顔で解説する我らがメンター隊長、若林さん   私は、webサイトを作りたいと言ってくれた忍者さんのお手伝いをしました。   HTMLを教えるのは初めての経験でしたが、私の方が大変勉強になる貴重な時間を過ごさせてもらいました。ありがとう、忍者さん。また来てね。   13時から始まったCoderDojo奈良も、あっというまに2時間が過ぎ、最後は、忍者さん達に本日の成果を発表してもらいました。どの忍者さんも今日作った作品について、しっかりと自分の言葉で説明しておられました。そして、どの作品も創造力あふれる素晴らしいものばかりでした！      忍者さんの作品発表！   初めての奈良でのCoderDojoの開催、ということで、どんなふうになるのか正直不安感もありましたが、そんな心配が嘘のようにとても充実した楽しい時間を過ごすことができました。   参加くださった、忍者さん、忍者さんの保護者の方々、そして、メンターの皆様、どうもありがとうございました。   これからも継続的にCoderDojo奈良を開催して参りたいと思っております。   また、ぜひご参加ください。   そして、興味のある、忍者さん、メンターさん、どしどしご参加ください。   次回の開催は、2014年12月21日（日）の予定です。   詳細が決まり次第、お知らせします！  ","categories": ["blog"],
        "tags": [],
        "url": "/blog/coderdojonara_20141026/",
        "teaser": "/assets/images/500x300.png"
      },{
        "title": "第2回CoderDojo奈良　募集開始しました！",
        "excerpt":"こんにちは。   CoderDojo奈良メンター＆サイト管理人の堀居です。   この度、2014年第2回目のCoderDojo奈良の募集を開始しましたのでお知らせします。   **日程：2014年12月21日（日）１３：００より   場所：Women’s Future Center　http://wfc-wa.com/about/access**   ↓↓　お申し込みはこちらから　↓↓   http://coderdojo-nara.doorkeeper.jp/events/17336   次回は、12月21日、もうすぐクリスマス！！です。   というわけで、プログラミングを利用したプレゼント交換など（まだ考え中・・・）を企画しています。   詳細が決まり次第、お知らせします。   ではでは、ご参加お待ちしております。  ","categories": ["未分類"],
        "tags": [],
        "url": "/blog/%E7%AC%AC2%E5%9B%9Ecoderdojo%E5%A5%88%E8%89%AF%20%E5%8B%9F%E9%9B%86%E9%96%8B%E5%A7%8B%E3%81%97%E3%81%BE%E3%81%97%E3%81%9F%E3%80%82/",
        "teaser": "/assets/images/500x300.png"
      },{
        "title": "忍者さんが定員となりました。第2回CoderDojo奈良",
        "excerpt":"こんにちは！   CoderDojo奈良サイト管理人の堀居です。   次回のCoderDojo奈良ですが、忍者さんの応募が定員になってしまいました。   大変申し訳ありませんが、今後参加希望の方は、キャンセル待ちとなりますので、ご了承ください。   いやー。   第2回目は思ったより早く定員になりましたねー。   CoderDojo奈良に興味を持ってくれている忍者さんが増えてるのかもしれません。   うれしいです。   なお、メンターさんの募集は引き続き行っておりますので   興味のある方は、こちらからお申し込みください。   【メンター募集！CoderDojo奈良2014年12月21日】  http://coderdojo-nara.doorkeeper.jp/events/18185  ","categories": ["blog"],
        "tags": [],
        "url": "/blog/%E5%BF%8D%E8%80%85%E3%81%95%E3%82%93%E5%AE%9A%E5%93%A1%E3%81%A8%E3%81%AA%E3%82%8A%E3%81%BE%E3%81%97%E3%81%9F%E3%80%82%E7%AC%AC2%E5%9B%9Ecoderdojo%E5%A5%88%E8%89%AF/",
        "teaser": "/assets/images/500x300.png"
      },{
        "title": "第２回CoderDojo奈良 開催レポート！",
        "excerpt":"こんにちは。   CoderDojo奈良　広報担当　堀居です。   去る２０１４年１２月２１日、第２回CoderDojo奈良がWomen’s Future Centerにて開催されました！      第2回目も盛り上がりましたよ～    第２回は、忍者さん８名、メンター９名の参加となり、第１回同様、大盛況となりました。    なんだか人がいっぱい！   そして、今回のCoderDojo奈良は、クリスマスが近い、ということで、クリスマスムードたっぷりのDojoとなりました。 ほら。サンタさん。    若林サンタ！   第１回目と同様に、Scrachをする忍者さんとWeb制作をする忍者さんに分かれ、それぞれメンターが隣に座り、アドバイスしたり一緒に相談したりして、作品を作っていきました。    真剣な表情の忍者さん！      みんな真剣に取り組んでます！   およそ２時間、あっという間に時間が過ぎてしまいました。  そして、前回と同様に、それぞれの忍者さんの作品発表を行いました。    発表開始！    ちゃんと発表できてえらいな・・・。    いい笑顔～        みんな発表を真剣に聞いています。        プレゼント交換会！      そして、今回のCoderDojo奈良の一大イベント、「プレゼント交換会」です。  それぞれ５００円以下のプレゼントを持ち寄り、若林サンタが作ってくださった、Scrachのアプリを使っての交換です。  （若林サンタのScrachアプリのページはこちら→「プレゼントを選ぼう！」）   アプリの仕組みは、こんな感じ。  プレゼントをクリックすると・・・⇒    番号が表示されます！   そこで、あらかじめプレゼントに番号をふっておき、アプリをクリックして表示された番号のプレゼントがもらえる、というCoderDojoならでは、の方法でプレゼント交換を行いました。  若林サンタ、ありがとうございました！    プレゼント交換に並ぶ忍者さん。    高専のお兄さんもクリック！      最後はIchigojam。    Ichigojamというのは、こども用のプログラミング専用パソコン、だそうです。  サイトはこちら→IchigoJam – BASICプログラミング専用こどもパソコン   今回から参加されたメンターさんが持ってきてくださったのですが、私的にはこれがパソコンなの！？という感じでした。    これがichigojamだ！   Basicという簡単なプログラミング言語で動かせるそうで、画面を動かすだけではなく、LEDを点滅させたり、も可能だそうです。  ちょっとやってみたくなりました！   頑張れば、ロボットだって動かせる（！）そうなので、ご興味のある方は、一度試してみてはいかがでしょうか？  CoderDojo奈良でも、希望者が多ければ挑戦してみたいです。      次回は2015年2月8日に開催予定！    今回のCoderDojo奈良も大変楽しく、充実したものとなりました。参加いただいた忍者さん、メンターさん、どうもありがとうございました。   次回のCoderDojo奈良は、2015年2月8日（日）を予定しています。詳細が決まり次第、またお知らせいたします。どうぞ奮ってご参加ください！  ","categories": ["blog"],
        "tags": [],
        "url": "/blog/coderdojonara_20141221/",
        "teaser": "/assets/images/500x300.png"
      },{
        "title": "第3回CoderDojo奈良　募集開始しました！",
        "excerpt":"あけましておめでとうございます。   今年もCoderDojo奈良を宜しくお願いします。   より多くの忍者さんとメンターさんにお会いできるのを楽しみにしております！   どうも、CoderDojo奈良広報担当　ほりいです～。   この度、2015年第1回のCoderDojo奈良の募集を開始しましたのでお知らせします。   **日程：2015年2月8日（日）１３：００より   場所：Women’s Future Center　http://wfc-wa.com/about/access**   ↓↓　お申し込みはこちらから　↓↓   【忍者募集！】CoderDojo奈良2015年2月8日   また、同時にメンターさんの募集も行っております。   ご興味のある方は、下記からフォームからご連絡ください。   ⇒　CoderDojo奈良　メンター募集中！   では、お申込みお待ちしております！  ","categories": ["blog"],
        "tags": [],
        "url": "/blog/coderdojonara_20150107/",
        "teaser": "/assets/images/500x300.png"
      },{
        "title": "第３回CoderDojo奈良 開催レポート！",
        "excerpt":"こんにちは。   CoderDojo奈良　雑用担当　若林です。今回は、いつもの美人広報（？）堀居さんに代わって私が報告いたします。（といってもかなり遅くなりましたが…）   さる２０１５年２月８日、第３回CoderDojo奈良がWomen’s Future Centerにて開催されました！      直前の欠席者もありましたが、新しい忍者も増えました！    今回は、季節柄突然の体調不良で欠席の忍者もでましたが、ルーキー忍者３名を含む７名の参加がありました。    忍者、メンター、保護者のみなさん全員集合！   継続参加の忍者は今までの続きを、初めての忍者にはGoogle Blocklyの迷路から入ってもらいました。やはりLevel 10は難しくみんな苦労していましたが、その中でも学生メンターのアドバイスを受けながら、メンターさんより少ないブロックでLevel 10をクリアしてしまった忍者が！これは、かなり楽しみなことになってきましたよ。 🙂      音系アプリも登場    今回、自宅で音当てゲームを作ってきてくださった飯田さんに、アプリの紹介をお願いしキャラクターを動かすだけじゃないゲームのアイデアをみんなに共有していただきました。    ピアノが弾けるアプリもを発表してくれた忍者もいましたよ。    Scratchでアプリ作りにどっぷりハマっている忍者たちの表情は真剣そのもの。      次回は2015年3月7日に開催予定！    今回のCoderDojo奈良も大変楽しく、充実したものとなりました。   参加いただいた忍者さん、メンターさん、どうもありがとうございました。   次回のCoderDojo奈良は、2015年3月7日（土）に開催いたします。   どうぞ奮ってご参加ください！参加申し込みは、こちらから！   追伸   遅かった割に簡単なレポートでごめんなさい！  ","categories": ["blog"],
        "tags": [],
        "url": "/blog/coderdojonara_20150208/",
        "teaser": "/assets/images/500x300.png"
      },{
        "title": "第4回CoderDojo奈良　募集開始しました！",
        "excerpt":"こんにちは。   なんだかあたたかくなってきて、春を感じる今日この頃ですねー。   というわけで、第4回（2015年第2回）のCoderDojo奈良を開催します。   ※今回は土曜日開催です。   **日程：2015年3月7日（土）13:00より   場所：Women’s Future Center　http://wfc-wa.com/about/access**   ◇忍者さんの応募はこちらから   ↓↓   https://coderdojo-nara.doorkeeper.jp/events/21148   ◇メンターさんの応募はこちらから   ↓↓   メンター募集中のページ   皆様、どうぞ奮ってご参加ください。  ","categories": ["blog"],
        "tags": [],
        "url": "/blog/%E7%AC%AC4%E5%9B%9Ecoderdojo%E5%A5%88%E8%89%AF%20%E5%8B%9F%E9%9B%86%E9%96%8B%E5%A7%8B%E3%81%97%E3%81%BE%E3%81%97%E3%81%9F!/",
        "teaser": "/assets/images/500x300.png"
      },{
        "title": "第４回CoderDojo奈良 開催レポート！",
        "excerpt":"こんにちは。   CoderDojo奈良　雑用担当　若林です。   ２０１５年３月７日、第４回CoderDojo奈良がWomen’s Future Centerにて開催されました！    忍者、メンター、保護者のみなさん全員集合！      忍者もメンターも初参加の多い回となりました    今回は、小学一年生から六年生までの６名のルーキー忍者が参加してくれました。初心者向けには、まずblockly迷路というゲームでScratchのと同じ操作方法に慣れてもらい、メンターと一緒に同じゲームをつくることで使い方とプログラミングの進め方を学んでもらいます。   PCの調子が悪いなどで多少のトラブルはあったものの、それ以外はみんなちゃんとついてきてくれて、１時間ちょっとのレクチャーで同じアプリを完成させることができました！小学一年生の忍者には、難しい言葉などもありますがそこはメンターがサポートしていくので大丈夫ですよ。    みんな真剣そのものです。      新しいアイデアのアプリの発表もありました    お楽しみの発表タイム、残念ながらルーキー忍者からの発表はありませんでしたが、ベテラン忍者は全員発表してくれました。一見ピアノには見えないピアノアプリや自分で考えたオリジナルアイデアのゲームなど、みんな個性の豊かな作品を発表してくれました。   唯一Web制作で頑張っている忍者、彼も一貫してオリジナルの鉄道会社のサイトを作っているのですが、今回は春のキャンペーンサイトを作ってくれました。これは、みなさんにも見ていただけるよう次回以降でサポートしていきたいと思います。    音色の変えられるピアノアプリ   教えてもらったゲームから自分のアイデアを加えた新しいゲームも出てきました      作品の「共有」を進めたい    Dojoの中で自分の作品発表したり、作ったものを公開・共有するのは勇気がいるものです。「自信が無いから発表しない、公開しない」ではなくて、「発表、公開できるものを目指して作っていく」ことをモチベーションの源泉にできるようにサポートしていきたいと思います。   次回開催については、決まり次第おしらせしますのでいましばらくお待ちください。  ","categories": ["blog"],
        "tags": ["奈良"],
        "url": "/blog/coderdojonara_20150307/",
        "teaser": "/assets/images/500x300.png"
      },{
        "title": "第5回CoderDojo奈良　募集開始しました！",
        "excerpt":"こんにちは、CoderDojo奈良　広報担当　ほりいです。   いよいよ春が近づいてきましたね！桜の開花ももうすぐ～。   というわけで、第5回（2015年第3回）のCoderDojo奈良を開催しますよ～。&lt;/br&gt;   **日程：2015年4月18日（土）10:00 – 12:00   ** ※今回は土曜日開催、時間が午前中となりますので、ご注意ください。**   場所：Women’s Future Center　http://wfc-wa.com/about/access**   ◇忍者さんの応募はこちらから   ↓↓   https://coderdojo-nara.doorkeeper.jp/events/22770   ◇メンターさんの応募はこちらから   ↓↓   メンター募集中のページ   皆様、どうぞ奮ってご参加ください。  ","categories": ["blog"],
        "tags": [],
        "url": "/blog/coderdojononara_20150325/",
        "teaser": "/assets/images/500x300.png"
      },{
        "title": "第５回CoderDojo奈良 開催レポート！",
        "excerpt":"こんにちは。   CoderDojo奈良にてメンターをさせていただいております、飯田です。はじめまして。   ２０１５年４月１８日、第５回CoderDojo奈良がWomen’s Future Centerにて開催されました！   レポートの公開が遅くなり申し訳ありません。      忍者、メンター、保護者のみなさん全員集合！      大勢の忍者が参加してくれました    4月は土曜日、午前中の開催でした。初めての時間枠でしたが、いつもと変わらず大勢の忍者が参加してくれました。Scratchでゲームづくりに挑戦。腕組みしたり、首をひねったり、取り組む姿勢は真剣そのものです。      忍者もメンターも、みんな真剣に取り組んでいます。       ゲームのプログラミングに取り組む中で、うまくいかなくて詰まっていたところに発見があったときなど、つい笑顔がこぼれます。      手取り足取り教えます？？          発表タイムにも慣れてきたかな    発表タイムでは作ったゲームを前のスクリーンに映して、工夫したところ、難しかったところを忍者が自分で発表します。それに対してメンターがアドバイスをコメントします。   こうして毎月繰り返すうち、例えば、これまで作ってきたアプリに「変数」を使うことで得点や体力を表現して、本格的なゲームに近づいてきました。      プロジェクターで映して工夫したところを発表します       CoderDojo奈良で用意しているのはScratchとWebですが、今回はお試しでフィジカルコンピューティングに挑戦した忍者もいました。Arduinoという小さな基板にLEDや抵抗といった電子部品を配置して、パソコンのプログラムから制御できるものです。少し難しかったようですが、パソコンから飛び出してモノが動くところには興味津々なようでした。      LEDがチカチカするのなんだろう          これからもよろしくお願いします    DojoではScratch、Webに取り組んでいますが、ゆくゆくはもっと本格的なプログラムや、Arduinoのようなハードウェアを使ったものなどにも挑戦していきたいと考えています。メンターはヒントを提供したり、アドバイスをすることはできますが、前に進めていくのは忍者の好奇心です。これからもよろしくお願いします。  ","categories": ["blog"],
        "tags": ["CoderDojo","奈良"],
        "url": "/blog/coderdojonara_20150418/",
        "teaser": "/assets/images/500x300.png"
      },{
        "title": "第６回CoderDojo奈良 開催レポート！",
        "excerpt":"こんにちは。   CoderDojo奈良にてメンターをしております、飯田です。今月もよろしくお願いします。   ２０１５年５月１７日、第６回CoderDojo奈良がWomen’s Future Centerにて開催されました！   忍者、メンター、保護者のみなさん全員集合！          ゲーム製作やWeb製作に取り組みました    今回も小学４年生から中学１年生まで、多くの忍者が参加して、Scratchでのゲーム製作、Web製作に取り組みました。メンターも忍者も取り組む表情は真剣です。   自分で考えて、メンターに相談して、          発表タイム、今回はご褒美も    CoderDojo奈良では、説明・自己紹介（10分）、プログラム製作（80分）、発表（30分）という時間割で過ごします。最後の発表の時間には、多くの忍者が発表に挑戦。進んで手を挙げる姿も見られるようになりました。   Webに取り組んだ忍者は動画を公開してくれました       初参加でシューティングゲームを作り上げる忍者も       今回は発表してくれた忍者に、メンターの若林さんからちょっとしたプレゼントがありました！か、かわいい。メンターの私も欲しくなりました。自分のパソコンに貼ろうかな？   発表した忍者にはちょっとしたご褒美が      同じテーマでもみな作るものが違います    似たテーマでゲーム製作に取り組んでいても、忍者それぞれにこだわりポイントがあるようです。メンターでは思いつかない工夫も多くあります。忍者ならではの気づきや工夫を形にすることを、これからも応援していきたいですね。  ","categories": ["blog"],
        "tags": ["blog"],
        "url": "/blog/coderdojonara_20150517/",
        "teaser": "/assets/images/500x300.png"
      },{
        "title": "第7回CoderDojo奈良　募集開始しました！",
        "excerpt":"こんにちは、CoderDojo奈良でメンターをしています飯田です。   晴れた日はピクニックや外でバーべーキューなどしたい季節になりました。アウトドアも大好きなんです。   というわけで、第7回（2015年第5回）のCoderDojo奈良を開催しますよ～。   **日程：2015年6月13日（土）9:30 – 12:00   ** ※今回は土曜日開催、時間が午前中となりますので、ご注意ください。**   場所：Women’s Future Center　http://wfc-wa.com/about/access**   ◇忍者さんの応募はこちらから   ↓↓   https://coderdojo-nara.doorkeeper.jp/events/25716   ◇メンターさんの応募はこちらから   ↓↓   メンター募集中のページ   皆様、どうぞ奮ってご参加ください。  ","categories": ["blog"],
        "tags": [],
        "url": "/blog/coderdojononara_20150524/",
        "teaser": "/assets/images/500x300.png"
      },{
        "title": "第７回CoderDojo奈良を開催しました",
        "excerpt":"こんにちは、CoderDojo奈良の若林です。2015年6月13日、第7回CoderDojo奈良をWomen’s Future Centerにて開催しました。   &lt;/p&gt; いつもの集合写真から      今日は、シューティングゲーム作りをやりました。    今回は、小学２年生から中学１年生まで７名の忍者が参加、メンターが２名と少なかったので、自分の作品をもくもく取り組むグループと、みんなで一緒にシューティングゲームを作るグループとに分かれて作品作りを行いました。    みんなで作品作り      発表タイム、みんな個性の豊かな作品を発表    今回は、みんなで同じものを作るというテーマでしたが、それでも独自のものを作ったり、みんなでやってることを横目で見ながら自分でアレンジしたものを作ったりと、自分なりにできる忍者も増えてきて嬉しい限りです。小学２年の女の子忍者は、ハートのイラストや花の写真の背景に、可愛いキャラで独特の世界を持ったシューティングゲームを作ってくれました。    オリジナル作品の発表もありました。      これからが楽しみな忍者も現れました    今回、Dojoとしての作品作り以外に嬉しかったことがありました。ひとつは、6年生の忍者が率先して２年生忍者を教えてくれていたこと。彼は、普段から礼儀正しく、話し方もハキハキしているので他の忍者のことも安心して任せられます。特に低学年の子には、年齢の近いお兄ちゃんお姉ちゃんの方が接しやすいと思いますので、彼みたいな存在がもっと増えればいいなと思います。将来的にはメンターになって欲しいし、これからが楽しみな忍者です。   もうひとつは、５年生の忍者がDojo終了後に「もっと難しいことに挑戦したい」と相談に来てくれました。彼のいう、「難しいこと」がよくわからない部分もあったのでWebプログラミング、ロボット、電子工作などの例をあげて、一度関連書籍を本屋さんで見て、どんなことをやってみたいか探ることを提案しました。その上で、やりたいことが見えたらDojoの日以外でも連絡してくれていいことを伝えました。彼もまた、これからが楽しみです。CoderDojoをやってると、こういった忍者との出会いがあるのがいつも励みになりますね。 🙂  ","categories": ["開催記録"],
        "tags": [],
        "url": "/blog/coderdojonara20150613/",
        "teaser": "/assets/images/500x300.png"
      },{
        "title": "第9回を開催しました。",
        "excerpt":"CoderDojo奈良の若林です。2015年9月12日、9回目のCoderDojo奈良を開催しました。   今回は、参加可能なメンターさんの人数が少なかったため、忍者の募集数も少なく4名の参加で、うちおひとりが体調不良のため欠席となり、忍者3名での開催となりました。   無理はできないのですが、やっぱり人数は多い方がいいですね。人数が少ないと場としての盛り上がりに欠けてしまいます。とはいえ、メンターさんが少ないのに多くの忍者に参加してもらうのは難しいので頭の痛いところですが、最近力をいれていなかったメンターのリクルートに力をいれていきたいと思います。         黒い画面の忍者登場    そんな中、今回のトピックは黒い画面の忍者が登場したということに尽きます。登場といっても、以前から参加してくれていた忍者なのですが、第7回の時に「もっと難しいことに挑戦したい」といっていた忍者が前回はWebに、今回はなんとPerlに挑戦しました。前回はWebだったので「前はWebだったよね？Perlプログラミングをしていくことにしたの？」と聞くと、「色んなことをやってみようと思って」と真顔で答えられ、自分の考えていたことと、彼の考えていることのギャップを感じました。   新しいことに挑戦していくということは、彼にとっては可能性のひとつでしかないのです。だから、とりあえずやってみる、難しいことは何も考えずにとにかくやってみる。「あぁ、この感覚は今の自分には無かったな」ととても新鮮な気持ちになりました。      彼は、お父さんから借りたというこの本を見ながら、エディタでプログラムを書き、コマンドプロンプトで実行し、トライ&amp;エラーを繰り返しながら、発表タイムには動くものを発表してくれました。   発表を見ていた他の忍者には、何をやっているのかさっぱりわからないと思い、今回作ったPerlのプログラムとScratchとの対比でどの行がScratchのどのブロックに対応するかを説明していったところ、Scratchならブロック5個で作れてしまうプログラムだということがわかりました。   つまり、Scratchを使えばブロック5個、彼ならScratchで数分で書けてしまうプログラムを、Perlで2時間かけて作ったということになります。彼は次回、何に挑戦するのだろう。それも楽しみですが、彼の作ったプログラムを見た忍者も、自分たちの知らない世界に挑戦してみたいと思ってくれればいいなと思います。  ","categories": ["blog"],
        "tags": [],
        "url": "/blog/coderdojonara9th/",
        "teaser": "/assets/images/500x300.png"
      },{
        "title": "第12回目Dojoを開催しました",
        "excerpt":"2015年12月20日（日）、今年最後のDojoを開催しました。   2014年の10月にスタートし、何度か開催しなかった月があったため今回が12回目となりました。   参加してくださるメンターの人数に応じて忍者の募集人数を調整しているため、各回の募集人数は異なるのですが、今回は久しぶりに10名の募集となりました。   今までやっていたScratch作品を続ける忍者、当日思いついたものを作り上げる忍者、Visual Studio + C#でWebフォームを作る忍者などそれぞれ様々ですが、継続的に参加している忍者は確実にスキルアップしているなと感じる一方、次にステップへ踏み出す力添ができていないなとも感じています。   幸い、メンターさんとして参加してくださる方も増えてきているので、せっかくの忍者のやる気と発想力を伸ばせるよう来年は活動していきたいと思います。     ","categories": ["開催記録"],
        "tags": [],
        "url": "/blog/12th-dojo/",
        "teaser": "/assets/images/500x300.png"
      },{
        "title": "Big start of 2016",
        "excerpt":"1月9日の土曜日、2016年最初のDojoを開催しました。今回は、忍者とメンターを合わせて20名以上の参加。中学生のメンターさんや、普段は梅田や長岡京でメンターをやっておられる方も来てくださって、とても賑やかな始まりとなりました。   多くのメンターさんのおかげで、ちょっと停滞気味だった忍者も一歩前へ踏み出せたり、新しいことにチャレンジしようと考え出した忍者も増えてきて、今年一年盛り上がってきそうな予感がします。   CoderDojo全体としても昨年あたりから急激な盛り上がりを感じているので、私たちも新しいメンターさんの獲得などで、忍者たちのチャレンジに応えられるようにしていきたいです。                             ","categories": ["blog"],
        "tags": [],
        "url": "/blog/big-start-of-2016/",
        "teaser": "/assets/images/500x300.png"
      },{
        "title": "より多くの選択肢を",
        "excerpt":"2016年2月13日、14回目のCoderDojo奈良を開催しました。   今回は、10日の時点で5名の初参加忍者を含む13名の忍者の応募に対して4名のメンターでしたが、ひとりでも多くの忍者に場を提供したいということで、その時点の申し込み者全員に参加していただくことにしました。   結果的には予定していなかったメンターさん2名も参加してくださったことなどもあって、みんなそれぞれの作品に取り組めていたようです。   今回印象的だったこと   今回のDojoで、初参加忍者のうち小学一年生の二人（男の子と女の子）が教え合っていたことがとても印象的でした。二人には、Blockly迷路にトライしてもらったのですが、自分がわかったことをお互いに教え合って仲良くやっていました。大きくなっても、同じような感じで協力しながらやってくれたらいいなぁと思います。   より多くの選択肢を   発表タイムでは、忍者の作品発表以外にメンターもそれぞれプログラムの紹介を行いました。生駒さんの「Scrath版竹内関数っぽいもの」と若林が先日開催したRuby勉強会の課題プログラムを紹介。忍者たちには難しかったかもしれませんが、色んなことに興味を持って接してくれればいいなと思い紹介しました。   Dojo終了後には、初参加の中学生忍者が「Scratchはあまり興味が持てそうになかったので、次はWebをやってみたいけどどんなことをやるのか？」と相談に来てくれました。   このところ、Webや言語プログラミングに関心を持つ忍者が増えてきているので、これらの選択肢も増やせるようにメンターもスキルアップしていかないとなと思うDojoでした。           ","categories": ["未分類"],
        "tags": [],
        "url": "/blog/more-choises/",
        "teaser": "/assets/images/500x300.png"
      },{
        "title": "新しい仲間",
        "excerpt":"3月の更新を滞らせているうちに4月のDojoを迎えてしまいました。   3月から新たにメンターとして参加してくださる方を、3名お迎えしました。二人は奈良高専の学生さん、ひとりは社会人の方で、この方も奈良高専一期の卒業生で奇しくも奈良高専先輩・後輩メンターグループができています。 🙂   私は「3つ年上の人にサポートしてもらう」というのが理想的かなって思ってます、勝手に。例えば、小学校低学年だったら高学年の、小学校高学年だったら中学生の、中学生だったら高校生の、というように「3つ違い」ぐらいの年齢差の方がいいかなって思います。歳の離れたメンターだと学校の先生みたいですしね。   そういう意味では、学生メンターさんの参加は嬉しいです。参加してくださった学生メンターさんも「楽しかったです！」と言ってくれて、4月のDojoのふたりとも参加してくれました。   しかも、4月のDojoではkinectを持ち込んで、自分たちが作った「モーションキャプチャ＋映像エフェクト」作品をデモしてくれて、忍者たちも興味津々でした。学生メンターさんには作品発表の場、忍者たちには新しい体験の場としてDojoが機能してくれたら嬉しい、そこからお互いにステップアップするきっかけになったらいいな〜って思います。学生メンターさんにとっても、プレゼンとかコミュニケーションのいいきっかけになりますしね。   忍者たちも毎回楽しみにしてくれているようで、「こんにちは〜」と大きな声で来てくれると本当にDojoやっててよかったな〜って思います。   ニコニコ楽しみながら猫逃げをつくってくれたルーキー忍者    学生メンターさんと一緒にC#にチャレンジする忍者    女の子忍者の作品はビジュアルに凝ってます    kinectを使ったモーションキャプチャーでビームを出しました    また、来月会おう！   ","categories": ["blog"],
        "tags": [],
        "url": "/blog/new-mentors/",
        "teaser": "/assets/images/500x300.png"
      },{
        "title": "Computer Science for ALLに掲載されました",
        "excerpt":"本日、NPO法人CANVASさんが運営されている、Computer Science for ALL プログラミング教育普及プロジェクトにCoderDojo奈良とCoderDojo生駒を取り組みのひとつとして掲載していただきました。   他にも多数の取り組みが掲載されていて、たくさんの仲間がいて心強く感じます。CoderDojo奈良、CoderDojo生駒も頑張っていきます。 :)  ","categories": ["blog"],
        "tags": [],
        "url": "/blog/computer-science-for-all/",
        "teaser": "/assets/images/500x300.png"
      },{
        "title": "Progate for Schoolでプログラミングを学ぼう",
        "excerpt":"今回、ご縁あってProgateさんが提供する「Progate for School」のサービスをCoderDojo奈良、CoderDojo生駒の忍者とメンターさんで利用させていただけることになりました。言語が2つ選択できるということで、使う機会が多いと思われる「HTML&amp;CSS」「JavaScript」を選択させていただきました。   Progate for Schoolとは  「Progate」とはオンラインプログラミング学習サービスで、インターネットで接続できる環境なら、いつでもどこでも自分が学びたいプログラミング言語を学ぶことができます。進捗も自分のアカウントで記録されているので、すぐに前回の続きを始めることができます。   Progate   「Progate for School」とは、このオンラインプログラミング学習サービスを学校向けに提供されているプランで、２言語まですべての学習コンテンツを無料で利用できます。今回は特別にCoderDojo奈良、CoderDojo生駒の忍者とメンターさんのために提供してくださいました。なんて太っ腹な！   Progate for School   「Progate」のコンテンツは、入門レベルからステップバイステップで進んで行くので、本を使って自学自習するよりも取り組みやすくなっています。きっと、忍者のみんなにも取り組みやすいはず。メンターさんにも「JavaScriptはあんまりやったことない」という方もいらっしゃいますので、是非この機会に学んでいただこうと思います。自分も我流でやってきたのでこれを機会にやり直そうと思います。   Progateさん、ありがとうございました！  ","categories": ["blog"],
        "tags": [],
        "url": "/blog/progate_for_school/",
        "teaser": "/assets/images/500x300.png"
      },{
        "title": "ローカルネットワークを手軽につくる",
        "excerpt":"突然ですが、Dojoやってるとローカルネットワークが必要になることってありますよね？ありませんか？ 私たちのDojoでは8月に8x9Craftをやらせていただいたのですが、その時に使っていたルーターがローカル内での通信をブロックする設定になっていて困ったことがありました。   不特定多数の方が使う可能性がある公共の施設のWi-Fi環境であれば、ローカル内での通信をブロックするのは適切なセキュリティ対策だと思いますが、Dojoの活動では困ってしまいました。   その時は、8x9Craftの作者である寺園さんが自身のスマートフォンのテザリング機能（スマートフォンをアクセスポイントにして他の機器をインターネットに接続できるようにする機能）を使ってくださって事なきを得たのですが、毎回テザリングを使うわけにもいきません。      回線契約によってテザリングが使えるものと使えないものがあり、使えない契約の方がほとんど。誰でも使えるわけではない。   PCをテザリング接続するとインストールしているアプリによって（例えばDropboxみたいなクラウドストレージ同期を行うもの）はインターネットへの接続が多数発生してしまい、パケット消費が起こってしまう。   ローカル内の閉じたネットワークが必要なだけなのに、本来の目的と無関係なパケット消費が起こってしまうのは得策ではありません。   これらの状況に対応するため、Wi-Fiルータをもうひとつ用意してローカルネットワークを構築しようと考えたのですが、大きなルータをDojoごとに持ち歩きたくないので小さなものは無いか？と探して見つけたのが、こちらでした。      出先とかホテルなど有線LANしかないところで、自前のWi-Fi環境を作るための持ち運びできるWi-Fiルータです。写真では大きさがわかりにくいかもしれませんが（詳しくはリンク先をみてください）、シャツの胸ポケットにも入れられる大きさと軽さなので、Dojoの荷物の負担になりません（当Dojo比）。   値段もamazonで1,400円ぐらいと安く、もし自分の目的で使えなくても個人的な持ち運びルータとして使えるしということで買ってみました。結果まったく問題なし！電源もUSBから取れるので電源の心配もありません。   設定で      1.バックボーンに有線LANを使う   2.バックボーンに別のWi-Fi接続を使う   3.別のWi-Fiをブリッジする   4.ローカルネットワークにする   が選べるのですが、３以外ならどれでもローカルネットワークを作れるようです。１と２は単にインターネットに接続されないだけ。そういう意味では４の設定の存在がよくわからないけど。   小型のルータということで、接続数がどれぐらいまでいけるのかが気になりましたが、今日使ってみたところホスト１台とクライアント４台、計５台の接続で8x9Craftをやりましたが、まったく問題ありませんでした。   ローカル用のルータを用意することで、インターネットに接続するためのWi-Fiルータの負担を下げられるというメリットもありますし、コスト的にも荷物的にも負担が小さく、テザリングによるパケット消費もないのでオススメです。  ","categories": ["blog"],
        "tags": [],
        "url": "/blog/how-create-local-netowrk/",
        "teaser": "/assets/images/500x300.png"
      },{
        "title": "CoderDojoの予定を自分のカレンダーにいれよう",
        "excerpt":"CoderDojo奈良・CoderDojo生駒の開催予定は、Googleカレンダーで公開しています。Googleカレンダーをお使いの方は、自分の予定と一緒に見られると、予定が立てやすくなるのでオススメです。   Google公式に他のユーザーのカレンダーを追加する方法の説明がありますので、この中の「リンクを使用して追加する」の手順に従ってください。   この時、入力するリンク（URL）はhttps://calendar.google.com/calendar/ical/nara.jp%40coderdojo.com/public/basic.icsになります。   GoogleカレンダーでCoderDojo奈良・CoderDojo生駒の開催予定をしっかりチェックしてくださいね！  ","categories": ["blog"],
        "tags": [],
        "url": "/blog/calendar/",
        "teaser": "/assets/images/500x300.png"
      },{
        "title": "ユースメンター\"Youth Mentor\"制度を導入します",
        "excerpt":"このたび、CoderDojo奈良とCoderDojo生駒では、ユースメンター”Youth Mentor”制度を導入することにしました。   同様の制度は、国内外の他のDojoでも導入されているケースがあるかもしれませんが、今回導入する制度は独自に設定したものです。   ユースメンター”Youth Mentor”とは  ニンジャをサポートしたりメンターから相談を受けたりする役割を負うニンジャ（18歳未満）をユースメンター”Youth Mentor”と呼ぶ制度です。   ユースメンター”Youth Mentor”は、通常は他のニンジャと一緒に参加していますがニンジャから質問や相談を受けた場合はサポートする義務があり、メンターからの相談にも対応しなければなりません。   「メンターがニンジャに相談するの？」と思われることもいらっしゃるかもしれませんね、ニンジャにもそれぞれ得意な分野があり、時にはメンターよりも詳しい場合もあります。   ユースメンター制度の狙い  ユースメンター制度を新設する狙いは次のとおりです。   ニンジャのステップアップ  奈良のDojoも設立から3年以上が経過して、初期から参加しているニンジャはそれなりの経験を積んでいます。そのニンジャ達がサポートする側に回ることで新しい経験を積むことができ、ニンジャ達のステップアップの一助になることを期待しています。   コミュニケーションの促進  ユースメンター制度を導入することで、ニンジャとユースメンターのコミュニケーションが促進されることを期待しています。ニンジャの中には「自分が教えてもいいかな」と思っている子もいるけれど、なんとなく自分から言うのは恥ずかしい。そういう気持ちのニンジャがいるのではないかと考えました。 また、年の離れたメンターよりも「先輩」にあたるニンジャとコミュニケーションする方が良い場合もあり、メンターが助けられることもあります。   そこで「サポートする立場」を明確にすることによって、相談しやすくまた答えやすくなることを期待しています。   思春期を迎えるニンジャへの対応  参加しているニンジャの多くは小学生ですが、設立から３年以上経った今、中学校に上がるニンジャも出てきます。思春期を迎えて、中には「小学生に混ざって活動すること」や「小学生と一緒にニンジャと呼ばれること」に恥ずかしいという気持ちを持ったり、抵抗を感じるニンジャも出てくるのではないかと考えました。   そういったニンジャの心理的障壁を取り除くことができ、継続的にDojoに参加してもらえることを期待しています。   ユースメンターになるには？  ユースメンターは自己申告制です。ユースメンターとして活動したいと思った場合は、メンターにそのことを伝えてください。ユースメンターになるための条件は「ユースメンターとして活動することに同意」すればOKです。   また、メンターからユースメンターに指名されることはありません、すべて自分の意思で決めるものとします。   自己申告ですので、小学１年生のユースメンターということもありえますが、それを拒否することはありません。ただしユースメンターはニンジャの相談役でなければなりませんので、その役割を自主的に負えない場合は年齢に関係なくユースメンターを降りていただくことはあります。   いつまでもみんなの居心地の良い場所であるために  今回の制度は、プログラミングスキルを向上させるためのものではありません。副次的にはそういった効果が見えるかもしれませんが、目的は今まで以上に交流すること、Dojoがみんなにとっていつまでも居心地の良い場所であり続けることを目指しています。   これからも、CoderDojoの活動へのご支援をよろしくお願いいたします。  ","categories": ["blog"],
        "tags": [],
        "url": "/blog/youth-mentor/",
        "teaser": "/assets/images/500x300.png"
      },{
        "title": "CoderDojo奈良・CoderDojo生駒のオリジナルパーカーを作りました。",
        "excerpt":"こんにちは。CoderDojo奈良・CoderDojo生駒のメンター、静野です。 チャンピオンの若林さんの『お揃いのパーカー作りたいね』という発言から約１年、念願のパーカーが完成しましたので、デザインのシェアと合わせてこちらに記事を書くことにしました。 パーカーを作るに至った経緯、デザインから完成までの流れを綴りました。 データのダウンロードは文末にあります。お急ぎの場合は一気に下へどうぞ:point_down: はじまり はじまりは昨年2017年2月。 チャンピオンの若林さんから、お揃いのパーカーを作ろう！という提案がありました。 提案があった時、「あ！確かにチーム感が出るし、特にイベントの時にあるといいかも！」という気持ちになりましたが、お揃いのパーカーを作るためにはデザインが必要です。 適当な場所にロゴを入れるだけでも作ることは出来ますが、自分が、そして他のメンバーが「欲しい！着たい！」と感じるような気分の高まるデザインにしたいところです。 チャンピオンからのデザインに関する希望は、こんな内容でした。 奈良・生駒 腕にラインを入れる。 チャンピオン：太い線１本 メンター：細い線２本 忍者、他：線無し 所属Dojo名 後ろからみても、何かわかるようにしたい。できれば面白くしたい。 例）風魔がちょっと顔出してるみたいな。 陰陽だけじゃわからないので、”CoderDojoも前面に。 あまり大きくない方がかっこいい。 衣料品のデザイン経験のある方、もしくはその道のプロにお任せできれば安心ですが、その時は名乗りを上げる方はいなくて、メンターの中で案を出したのは、おそらく私だけでした。 そんな状況の中、季節は流れて、パーカー作りは一旦中断になります。 DojoCon Japan 2017の開催 春になり、チャンピオンの若林さんと私は、2017年秋に開催されたイベント、DojoCon Japan 2017の実行委員として2017年5月から活動を開始しました。 まずは、DojoCon Japan 2017の公式サイトをご覧ください。 DojoCon Japan 2017公式サイト この素敵なデザインのアクセントになっている、ドット絵の魅力。 そして、実行委員として活動する中でチャンピオンが感じたこと。 パーカーの話から突然どうしたの？思われるかもしれませんが、このDojoCon Japan 2017がパーカーのデザインに大きな影響を与えることになります。 やっぱりパーカーを作りたい DojoCon Japan 2017が盛況の内に終わり、少しだけ落ち着いた2017年11月中旬。 CoderDojo奈良・CoderDojo生駒のメンバーslackに、チャンピオンからパーカー作りを再開しましょう！というメッセージが届きます。 @shizuno さんのデザインでとりあえず試作してみようかなと思いますが、静野さんDojoCon Japanなども経てここを変えたいとかありますか？・・・・・・” びっくりです！他の方からも案が出ると思って、こんなのどう？と雰囲気で出した案です。 考えはしましたが、かなりざっくりとした案。 どうしよう！！！と焦りました。...","categories": ["blog"],
        "tags": [],
        "url": "/blog/hoodie/",
        "teaser": "/assets/images/500x300.png"
      },{
        "title": "Our hoodie",
        "excerpt":"We made our Dojo original hoodie design. On the front body, CoderDojo logo and “Fuma” which is the character of CoderDojo Nishinomiya / Umeda are printed.”Fuma” is not our character, but “Fuuma” is used DojoCon Japan and we love them. On the back, our Dojo name and logo are printed....","categories": ["blog"],
        "tags": [],
        "url": "/blog/our-hoodie/",
        "teaser": "/assets/images/500x300.png"
      },{
        "title": "CoderDojo生駒が二人代表になります",
        "excerpt":"これまで、CoderDojo生駒は若林が代表（CoderDojoではチャンピオンといいます）として運営してきましたが、長らくメンターとして活動してくださっている石川さんが一緒にCoderDojo生駒の代表として運営に関わってくださることになりました。   元々生駒は市民活動が活発な土地柄で、その中でCoderDojo生駒の代表が生駒市民ではない、ということに違和感はありました。   石川さんは生駒と奈良だけではなく、大阪のDojoやDojo関係イベントのスタッフをやっておられてCoderDojoへのコミットはただならぬものがあります。   そこで石川さんに共同代表を打診し、快諾をいただきました。   いきなり交代というのも大変なので、当面は共同代表ということで二人制にしつつ、主たる運営を石川さんにシフトしながら、最終的には僕も共同代表を降りるという流れにしたいと思います。   石川さんが代表をしてくださることで、CoderDojo生駒はこれからもより継続的で発展的な活動になると思います。これからも、CoderDojo生駒の活動へのご支援をよろしくお願いいたします。  ","categories": ["blog"],
        "tags": [],
        "url": "/blog/the-new-champion/",
        "teaser": "/assets/images/500x300.png"
      },{
        "title": "ScrapDojoで、機械の分解やりました",
        "excerpt":"こんにちは、若林です、9月29日に番外企画として機械を分解する「ScrapDojo」を開催しました。   いつもは、プログラムや電子工作で何かを「作っている」CoderDojoですが、機械を分解して中身を見るのも新しいものを作るためのヒントになるんじゃないか、普段できないことをやるのは面白いんじゃないかと思って   今回分解した機械たちです。      PlayStation2   ダブルカセットのカセットデッキ   PlayStation用コントローラDualShock   Wii用コントローラ（Wiiリモコンではなく、いわゆるゲームコントローラタイプのもの）   マウス、各種リモコンなど      新しい発見の連続  カセットデッキを見たニンジャの最初の質問が「これ、なんで二つついてるの？」でした。   そりゃそうですよね、そもそもカセットデッキを見たことがないだろうし、カセットテープで音楽を聴くというのがどういうことなのかもわからないわけで。 :) 他にもPS2の本体にボタン電池が入っている理由とか、ニンジャたちにはわからないことだらけ。リモコンを分解したニンジャは中のボタンが繋がっていることに驚いていました。   PS2はデジタル機器らしく、コネクタ以外の部品は表面実装で、部品点数も少なくすっきりした基板。アナログ機器であるカセットデッキの方は、コンデンサと抵抗がたくさん乗っててハンダつけも人間の手ハンダだと思われる仕上がり。コイルやプーリーなどの大きな部品も多くて全体的に大作りな印象。性質の異なる２種類の機械を用意したのはよかったです。       怪我をしないようにと軍手と保護メガネを用意したのですが、子供用のを調達したら想像以上に小さくて…小学生でも高学年の子には小さすぎました。なので、ひとりを除いて素手で作業していますが手慣れたニンジャばかりだったので、大きな怪我はありませんでした（手が痛くなったぐらいのことはあったかもしれません）。       まるでコンビナートみたいなPS2のマザーボード      若林個人としては、PS2のマザーボードがカッコよかったのがポイント高かったです。      PS2内蔵のボタン電池は、PSロゴ入りのレア品でした。      分解の様子がCoderDojo調布にも流れました！  ちょうど同じタイミングでCoderDojo調布が開催されていたらしく、調布のメンターさんが分解の様子を会場に流してくれました。思いがけなくコラボレーションできたのも嬉しかったです。こちらがその時の調布の様子。      次に向けて  今回参加したニンジャは3名でしたが約40分で用意したものはほぼバラされました笑。   次回やる時はもっと色々用意しないと思う反面、今回参加してくれたニンジャが手慣れた子ばかりだったので早かったのかもしれません。その辺りも考慮して次回を企画したいと思います。   怪我防止のため、モノタロウで子供用の保護メガネと軍手を用意しましたが、実物はかなり小さくて小学校低学年でちょうどぐらいです。高学年以上なら大人用の保護メガネと軍手でいいでしょう。   参考     安全めがね(児童用)   こども軍手 純綿 すべり止め  ","categories": ["blog"],
        "tags": [],
        "url": "/blog/scrapdojo-vol1/",
        "teaser": "/assets/images/500x300.png"
      },{
        "title": "CoderDojo奈良・生駒オンライン発表@zoom Vol.6を開催しました",
        "excerpt":"こんにちは、若林です。久しぶりのblog更新です。このサイトで使っているJekyllをかなり理解してきたので、ちょっと更新を頑張ってみようかなと思ったりしていますが、もしかしたら続かないかもしれません。   2021年3月27日に「CoderDojo奈良・生駒オンライン発表@zoom Vol.6」を開催しました。イベントページはこちら。   奈良は新型コロナウイルス感染症の影響による緊急事態宣言の対象外ではあったのですが、それでも現在の状況から外出することや人が集まる場所へ行くことへの抵抗感はあるかなと考え、3月まではオンライン開催としました。4月からはまたリアル開催にもどします。 昨年の緊急事態宣言発令時もオンライン開催をしており、試行錯誤を繰り返した結果「オンラインでは作品発表のみにした方が良い」という結論に至りました。 その理由は、     オンラインで黙々とプログラミングしてもつまらない。   ニンジャは一緒にプログラミングすることよりも発表してみんなに見てもらったり、感想をもらえることを楽しみにしている。   なにより、みんなと交流したいと思っている。   ということでした。   来月からまたリアル開催となりますが、オンライン発表会は普段CoderDojoに来られない方にも活動を知っていただくよい機会になるので続けていこうと思います。   当日の発表作品  当日の発表作品はこちらです。一部プロジェクト未公開\bのものがありますが、公開されたらリンクします。      Tスライム：https://scratch.mit.edu/projects/504805262/   Koto：ブロック定義の使い方（プロジェクト未公開\bのため公開されたらリンクします）   KittenLovey：カヌーゲーム（プロジェクト未公開\bのため公開されたらリンクします）  モチーフになったゲームはこちら：Pony island   たっくん：Unityで開発中のマインクラフト  開発時の参考にしているYouTube動画Minecraft Programming Speedrun (Unity, No Internet) in 14:06 [World Record]   ponde：https://scratch.mit.edu/projects/508021143/   田中さん（Unityで作った箱の中でバウンドするオブジェクト）   スタジオ  CoderDojo奈良・生駒には、CoderDojo Nara/Ikoma Studio/とCoderDojo Nara/Ikoma ニンジャ同窓会の2つのスタジオがあります。   CoderDojo Nara/Ikoma ニンジャ同窓会の方はニンジャが設立したスタジオで「同窓会」と名付けてくれているのが嬉しいですね。      CoderDojo Nara/Ikoma Studio/   CoderDojo Nara/Ikoma ニンジャ同窓会   では、また次のDojoでお会いしましょう。  ","categories": ["blog"],
        "tags": [],
        "url": "/blog/2021-03-27-online-presentation/",
        "teaser": "/assets/images/500x300.png"
      }]
